espressif/esp-gmf/gmf_examples/basic_examples/pipeline_http_download_to_sdcard/sdkconfig.defaults.esp32
CONFIG_IDF_CMAKE=y
CONFIG_IDF_TARGET_ARCH_XTENSA=y
CONFIG_IDF_TARGET="esp32"
CONFIG_IDF_TARGET_ESP32=y
CONFIG_IDF_FIRMWARE_CHIP_ID=0x0000

CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y

#
# IO File Configuration
#
CONFIG_GMF_IO_FILE_WRITE_CACHE_SIZE=8192
